package com.lyl.sharescontrol.net.api;

import retrofit2.Call;
import retrofit2.http.GET;
import retrofit2.http.Query;

/**
 * Created by lyl on 2017/5/15.
 */

public interface ShareApi {

    // var hq_str_sz000507="珠海港,9.710,9.690,10.000,10.390,9.640,9.950,10.000,113588106,1139727356.610,8100,9.950,55300,9.940,
    // 73800,9.930,140900,9.920,152800,9.910,114450,10.000,63100,10.010,92844,10.020,68600,10.030,52200,10.040,2017-05-15,
    // 14:16:00,00";

    // 0：”大秦铁路”，股票名字；
    // 1：”27.55″，今日开盘价；
    // 2：”27.25″，昨日收盘价；
    // 3：”26.91″，当前价格；
    // 4：”27.55″，今日最高价；
    // 5：”26.20″，今日最低价；
    // 6：”26.91″，竞买价，即“买一”报价；
    // 7：”26.92″，竞卖价，即“卖一”报价；
    // 8：”22114263″，成交的股票数，由于股票交易以一百股为基本单位，所以在使用时，通常把该值除以一百；
    // 9：”589824680″，成交金额，单位为“元”，为了一目了然，通常以“万元”为成交金额的单位，所以通常把该值除以一万；
    // 10：”4695″，“买一”申请4695股，即47手；
    // 11：”26.91″，“买一”报价；
    // 12：”57590″，“买二”
    // 13：”26.90″，“买二”
    // 14：”14700″，“买三”
    // 15：”26.89″，“买三”
    // 16：”14300″，“买四”
    // 17：”26.88″，“买四”
    // 18：”15100″，“买五”
    // 19：”26.87″，“买五”
    // 20：”3100″，“卖一”申报3100股，即31手；
    // 21：”26.92″，“卖一”报价
    // (22, 23), (24, 25), (26,27), (28, 29)分别为“卖二”至“卖四的情况”
    // 30：”2008-01-11″，日期；
    // 31：”15:05:32″，时间；
    @GET("/")
    Call<String> getShare(@Query("list") String shareCode);
}
